(function () {
  const url = "http://localhost:8182/download"; // 替换为你的服务端URL

  const lrc =
    "[00:00.000] 作词 : 王力宏\n[00:00.015] 作曲 : 王力宏\n[00:00.30]编曲 : 王力宏/刘志远\n[00:17.298]我的天空多么的清晰\n[00:24.298]透明的承诺是过去的空气\n[00:33.299]牵着我的手是你\n[00:38.299]但你的笑容 却看不清\n[00:48.299]是否一颗星星变了心\n[00:54.299]从前的愿望 已全都被抛弃\n[01:04.299]最近我无法呼吸\n[01:08.299]连自己的影子\n[01:13.299]都想逃避\n[01:16.299]BABY 你就是我的唯一\n[01:22.299]两个世界都变形\n[01:26.299]回去谈何容易\n[01:31.299]确定 你就是我的唯一\n[01:37.299]独自对着电话说我爱你\n[01:42.299]我真的爱你\n[01:47.299]BABY 我已不能多爱你一些\n[01:57.299]是否一颗星星变了心\n[02:03.299]从前的愿望 已全都被抛弃\n[02:13.298]最近我无法呼吸\n[02:16.298]连自己的影子\n[02:22.298]都想逃避 逃避\n[02:29.298]BABY 你就是我的唯一\n[02:35.298]两个世界都变形\n[02:40.298]回去谈何容易\n[02:44.298]确定 你就是我的唯一\n[02:50.298]独自对着电话说我爱你\n[02:55.898]我真的爱你\n[03:02.098]BABY 我已不能多爱你一些\n[03:09.098]其实早已超过了爱的极限\n[03:32.098]BABY 你就是我的唯一\n[03:38.098]两个世界都变形\n[03:43.098]回去谈何容易\n[03:47.098]确定 你就是我的唯一\n[03:53.098]独自对着电话说我爱你\n[03:59.098]我真的爱你\n[04:03.098]BABY 我已不能多爱你一些";

  const postData = {
    lrc,
    name: "唯一 - 王力宏",
    url: "https://ra-sycdn.kuwo.cn/0fe5a0d66e620d8b0a14e34b896c9335/65b8aa62/resource/n2/91/41/2274743438.mp3?from=vip", // 替换为要下载的文件的URL
  };

  fetch(url, {
    method: "POST",
    headers: {
      "Content-Type": "application/json",
    },
    body: JSON.stringify(postData),
  })
    .then((response) => {
      if (!response.ok) {
        throw new Error(response.statusText);
      }
      return response.text();
    })
    .then((data) => {
      console.log(data); // 输出服务端返回的数据
    })
    .catch((error) => {
      console.error("Error:", error);
    });
})();
